{
  "22": "\"",
  "24": "$",
  "574": ", ",
  "601": "01",
  "602": "02",
  "603": "03",
  "604": "04",
  "632": ". ",
  "15558": "XXX",
  "10847263": "Cash on Hand",
  "28942307": "customer experiences",
  "34725487": ", which surveyed over 300 user researchers, identified that the top goal of most research programs is understanding customer needs. Among teams who gather qualitative customer insights, their favorite outcome is making decisions with better evidence.",
  "36628140": "4. Tactical Insight Reports",
  "45231933": "My team's successful when they know both what our customers say and how to act on their feedback. As CX becomes the differentiator in a go-to-market strategy, customer insights matter now more than ever\"",
  "62365398": "Marketing teams often realize when their landing pages are dated. What they’re less equipped to do is update them in an effective manner. ",
  "66828415": "Marketing Expenses",
  "73173444": "Time Increase / Month",
  "-3d3b6f44": "Writing",
  "3c2336d": "About",
  "51a662d": "Your ",
  "37fb71ba": "customers hold the key",
  "184605d": " to unlocking sustainable growth.",
  "2d55a3e3": "I'm Stuart Balcombe. Early-stage growth nerd originally from England, now based near Philadelphia. Currently I'm a Product Marketer at ",
  "3a58693f": "Arrows.to",
  "-32fadf08": ", building ",
  "50c5cb24": "Procket",
  "-39991012": ", and advising early-stage startups.",
  "-660858c8": "Essays: Most popular",
  "3d503d2b": "No items found.",
  "-47761f27": "Newsletter",
  "-631999ab": "Get my writing in your inbox. Here’s an ",
  "-4edaee96": "example",
  "-17ca7335": " of what you’ll get.",
  "33b7d778": "Thank you!",
  "38eede5a": "Check your inbox to confirm your subscription.",
  "437fe647": "Oops! Something went wrong while submitting the form :(",
  "5d79ef87": "\"If you're trying to build great products that create real value in your customers' lives, but you're not on his list already, do yourself a favor & sign up.\"",
  "-4cc61811": "Claire Suellentrop",
  "7886d42": "Co-Founder, ",
  "-8cbb5a8": "Forget the Funnel",
  "438764c": "Intro",
  "-3f71e4bc": "The 3×3 framework constrains you to three questions with only three-word answers per question.",
  "291ee4": "What",
  "153a8": "Why",
  "11c30": "How",
  "-1ea25fa6": "Iterate",
  "4c25fbf": "Share",
  "3e0f4e8": "Check",
  "-1a034c7c": "Password Required",
  "10ee8b81": "If Stuart has not provided you with a password this page is for invited visitors only.",
  "-f5c4b5f": "Incorrect password. Please try again.",
  "-40b0787c": "Page Not Found",
  "583f3656": "The page you are looking for doesn't exist or has been moved.",
  "-77d3b04c": "Who is Stuart Balcombe",
  "-7c7b6206": "I’ve spent the past 7 years helping early-stage companies build and grow software products. My work is centered around 3 core values:",
  "6efd6ba9": "- Deeply understanding customers.",
  "200d": "‍",
  "-34181f54": "- Starting small and iterating quickly.",
  "2f3df534": "- Measuring success by outcomes not outputs.",
  "-64104400": "Contact",
  "-4a957ec3": "Hey! Feel free to tweet me: ",
  "-2eea2875": "@stubalcombe",
  "5b63f7f7": ", connect on ",
  "16ee36ae": "LinkedIn,",
  "-67b9f304": " or send me an email: ",
  "15e08a0a": "stuart@stuartbalcombe.com",
  "2e": ".",
  "19d33292": "Right Now",
  "-249623fc": "As of November 2021, I'm leading marketing at ",
  "4270e898": " and running my own independent business advising early-stage software companies on go-to-market strategy and building customer focused products.",
  "74e2c2e4": "Previously",
  "4437c013": "I’ve been working with SaaS companies since 2014 in growth marketing and product management roles. In 2018, I launched ",
  "7958b00": "PaymentLink",
  "6cdbaf86": ", a simple way for busy service providers to onboard new clients and get paid for their recurring work without code. This product originally started as part of my ",
  "6f44d0f8": "Web App Challenge",
  "-4cbdf3a6": "Selected blog posts",
  "-6f4e5efe": "Tactical Insights For Getting Closer To Your Customers",
  "5fb4d97f": "How much time are you leaving on the table? Find out.",
  "-3e35df41": "Total Investors",
  "-4649e96a": "How many people do you communicate with?",
  "12d22ebe": "Investor Updates Per Year",
  "3a51587c": "How often do you send reports to investors?",
  "-741c53c3": "Inquiries From Investors Per Month",
  "232bb5d1": "How many ad hoc emails and calls do you get a month?",
  "49d967af": "Your Annual Missing Time without X*",
  "3d8a2df9": "Time Increase / Year",
  "2d1113a8": "Cost Savings / Year",
  "-6230f671": "*Calculations are based on the average xuz",
  "5a0ea5a1": "Thank you! Your submission has been received!",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "5795c7b9": "Cash Summary",
  "2434795c": "Monthly Income",
  "-213fc40e": "Monthly Cash Sales",
  "5a0": "--",
  "7579f617": "Amount of cash being burned or (Cash Surplus) being generated each month.",
  "2f4921b9": "Months until cash balance is exhausted.",
  "7017fa0e": "Monthly Expenses",
  "-4ed02aa5": "Personnel Expenses",
  "2bc3c129": "Rent & Utilities",
  "-3b2398fb": "Office Supplies & Equipment",
  "-6a3494c6": "Travel",
  "-79093995": "Other Expenses",
  "41d7b263": "Total Expenses:",
  "70fa4be": "Cash Burn Rate Calculator",
  "331db0ed": "Calculate your burn rate and zero in on the date you’ll run out of cash — and the date you’ll start making a profit.",
  "4deeec81": "What is Cash Burn Rate?",
  "-3c0dda4d": "What’s a Rich Text element?",
  "2e633c6a": "The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create content.",
  "57fa6135": "Static and dynamic content editing",
  "-a016b40": "A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila!",
  "-4bffb26e": "How to customize formatting for each rich text",
  "-43ba1153": "Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system.",
  "7fbdc6e8": "Stuart Balcombe",
  "22a38ae9": "Discovery Sprints",
  "-4564c9a3": "Articles",
  "3caacbd4": "Customer Discovery Checklist",
  "-3e74324f": "Smart founders know learning fast is their greatest competitive advantage. Before you start your next project, ensure you can answer “",
  "430ba736": "hell yeah",
  "5d5f200": "” to the following gut-check questions.",
  "-70c10e7a": "Checklist",
  "-7e6ea356": "X out of Y",
  "7f27a3d0": "Uncheck All",
  "-18b30c7": "Learn how to ",
  "26e8180f": "understand why your customers really buy",
  "5778101c": "A complete playbook to master Jobs to Be Done interviews and unlock new growth for your business.",
  "eff781a": "PRe-Order Now",
  "-4a0bda9b": "What to expect from this course",
  "27682a4e": "Over the past 3 years, I've conducted hundreds of customer interviews for companies and clients I've worked with.",
  "5091400d": "They started as a way to understand how customers used our product and how we could improve their experience, but the impact of effective customer interviews is more far reaching than I ever could have imagined. Insights gathered during 1-1 conversations with customers can:",
  "-5a9160f6": "...save you wasting time building a feature no one uses.",
  "-7fc26646": "...unlock the key to rapid product adoption.",
  "bc533b3": "...drive your next killer marketing campaign.",
  "-72154ebc": "...become your highest converting landing page copy.",
  "7cd26eb3": "...and so much more.",
  "-6244b586": "The data speaks for itself, ",
  "eb609e0": "successful businesses are 242% more likely to conduct customer research",
  "-2c5b9be3": " at least once every quarter, and investing in ongoing customer research helps businesses ",
  "1ad24b7c": "grow 2-3x faster",
  "3aff5147": "Every time I conduct customer interviews I've been refining my process for unlocking the key insights that drive great product decisions and marketing campaigns. Now I'm releasing an ",
  "79c70a83": "in-depth series walking you step-by-step through how you can conduct effective jobs to be done customer interviews yourself.",
  "54ab7acb": "I’m going to cover everything you need to know:",
  "-1ea22c42": "Identifying your target audience.",
  "-2dad1f16": "Planning and scheduling your first interview.",
  "7ff25ab": "Asking the right questions.",
  "29e25430": "Organizing and leveraging insights for growth.",
  "208fa3a7": "And much more…",
  "-344987f9": "There is a lot to cover so I’ll be breaking this up into easy to follow modules you can complete in just 20 minutes each day.",
  "-5ef4586c": "Whether you’re building your first business or your fifth, ",
  "2dfad351": "the more deeply you understand your customers the more successful you’ll be.",
  "7fc8a250": " Anyone who wants to build a product customers love to pay for will find something valuable in this series.",
  "-59dad1f": "Thank you! Check your inbox for your confirmation email!",
  "-5901e2da": "Ready to get closer to your customers?",
  "7f734f1c": "The Interviews Playbook",
  "-20914c82": "A tactical playbook to uncover the deep customer insights that drive growth.",
  "111f93": "$249",
  "be76": "149",
  "-49b70514": "/episode",
  "3be9691f": "7 Lessons + Video Walkthroughs",
  "-24f024e0": "Customer Outreach Templates",
  "-3c608c6f": "Voice of Customer Swipe File Template",
  "-5eb5124b": "Team Insight Presentation Template",
  "c8c3ba7": "Interview Question Cheatsheet",
  "53423fa": "Pre-Order Now",
  "-6097eb99": "PLAYBOOKS + COACHING",
  "-113fb992": "Expert research services combined with tactical advice to help you make more confident customer insight driven decisions.",
  "d4fc": "749",
  "-4cc5b4d4": "Interviews Playbook Lessons & Videos",
  "6e35e039": "1-Hour Customer Discovery Strategy Call",
  "-5dca2875": "Outreach Templates & Cheatsheets",
  "-16283cba": "Interview Technique Analysis and Coaching",
  "23916fb2": "Stuart created a visual experience for a product that was still in the conceptual stage, so I could encounter any unexpected implementation issues and have something tangible to demo to customers. He delivered a rapid prototype that was great for idea validation.\"",
  "-4089f46b": "Bob Moore",
  "52695eb6": "CEO of ",
  "-353d5431": "Crossbeam",
  "13ede05": "Resources",
  "1fa3c2": "Blog",
  "4b0c1ae4": "Podcast",
  "-180b2fb8": "Free Guide",
  "-64202ba3": "Company",
  "4cf5967": "Terms",
  "5079bb68": "Privacy",
  "-105ab0a5": "© 2022 Balsm Labs LLC. All rights reserved.",
  "4b5b3630": "Subscribe to Short Loops - A newsletter by Stuart Balcombe",
  "7364d10d": "Insights for early-stage growth and product development that puts customer outcomes at the center.",
  "-2fc01e24": "Prototype and launch your startup idea in ",
  "73e3f16e": "one week",
  "-fe05d97": " without code.",
  "641c787f": "I help founders test their riskiest product assumptions, before wasting time and money building software no one uses.",
  "2007a0f9": "Schedule your free strategy session",
  "-75d09b86": "Or learn how I do it (Free Video)",
  "-62f821b3": "Are you ",
  "-2ff436b4": "confident",
  "685a7264": " you’re building the right product? ",
  "-531e93d2": "If not, why are you spending thousands of dollars and months of your valuable time building your MVP?",
  "5725241c": "As great as your idea might be, the chances are you’ll need multiple iterations and customer feedback to find product-market fit.",
  "-49c6c338": "How much will your MVP actually cost?",
  "-426dc11a": "Let's face it... you’ve probably been quoted tens of thousands of dollars and a 3-month timeline to build your MVP. But the problem isn’t just the expensive price tag. The longer you wait to test your product idea with customers the greater the opportunity cost of building the wrong thing as well.",
  "-60f59744": "The real cost of building expensive software before testing your idea with real customers is equal to:",
  "-32ffb5f2": "The time and materials expense of building the wrong thing.",
  "7355c557": "AND...",
  "-49e17998": "The chances, advantages, or momentum you lose by not building the right thing.",
  "-5fb738df": "Imagine if you could prototype your idea without code and get real customer feedback in days not months. You could save thousands of dollars, weeks of your valuable time AND have confidence you're building a product your customers want to buy.",
  "619fedd4": "\"Stuart created a visual experience for a product that was still in the conceptual stage, so I could encounter any unexpected implementation issues and have something tangible to demo to customers. He delivered a rapid prototype that was great for idea validation.\"",
  "3d0b261": "CEO, ",
  "279b4bda": "What if you could launch and test your MVP with real customers ",
  "-24dd4bca": "this week",
  "3f": "?",
  "-68376e9f": "Validate your riskiest product assumptions, raise capital, get your first customers, or increase adoption of an existing product with a clear process for researching, designing and testing without wasting money building a product no one uses (like 90% of people I talk to).",
  "-7e8c1269": "You need a clear process to quickly prototype and test your ideas.",
  "-55905e5f": "What if I can guide your team through a proven prototyping process so you can save months of USELESS iterations?",
  "e31e675": "You could short circuit the learning loop and make rapid progress to:",
  "-394cd3c0": "Quickly prototype your idea",
  "-1eaae190": "Get feedback from customers",
  "720b5ab0": "Prioritize the right next steps for growth",
  "-42db6d3b": "You’ll be armed with a clear process for quickly testing your idea without spending money building a product no one uses (like 90% of people I talk to).",
  "1b25b651": "Hey 👋 I’m ",
  "737b29dd": " a product designer, and no-code nerd who's spent the past 5 years helping early-stage startups understand their customers and ship value faster. ",
  "320f57c4": "Want to learn more? Schedule a free strategy session below and I'll help you identify your riskiest assumptions and create a plan to test them without code.",
  "-790c0fe5": "\"There are very few people I know in the industry that have the unique combination of skills, research-focused product knowledge mixed with the ability to execute on UI/UX.\"",
  "-4801d95a": "Ben Kochavy",
  "-7c083ebd": "Founder, ",
  "-3a751aa7": "ColdBru Digital",
  "-7b257679": "Brand Personality Sliders",
  "3924d9ed": "Shape how you want your brand, voice, tone, and story to be perceived.",
  "3ff0673": "Elite",
  "-506c37c5": "Mass Appeal",
  "5ad034a5": "Instructions: select point on range",
  "-58e3bd55": "Result: A,B,C",
  "-2dec296c": "Recommendation: X,Y,Z",
  "-2689717c": "Serious",
  "45cd5da9": "Playful",
  "6473a37c": "Conventional",
  "4b2ed56": "Rebel",
  "-62607880": "Mature & Classic",
  "35b9c3b7": "Young & Innovative",
  "-2862699a": "Episode 01",
  "5bfa5f6e": "This is the title of the episode",
  "6295283a": "I want to...",
  "-2cf04413": "Build a rapid prototype",
  "-218eec5d": "Understand my customers",
  "-d74f47d": "Create a brand that resonates",
  "749c903d": "Learn to make progress. Faster.",
  "-364d0a89": "Get Started",
  "6af22973": "Heading 1",
  "6af22974": "Heading 2",
  "6af22975": "Heading 3",
  "1b0e0a": "🚧",
  "1b2b4ff5": "jhjhjhjhjhk",
  "-272727b4": "kkjjkjk",
  "-47935682": "Headings, paragraphs, ",
  "67fbf844": "blockquotes",
  "2194f673": ", figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system.",
  "-514a26ae": "Who are you sprinting with?",
  "-4f469d3f": "By myself",
  "4a13c183": "With my company",
  "-60e149fb": "With my client",
  "-66663d82": "With my non-profit",
  "7d6f5b0b": "Want us to help you keep track of your progress?",
  "3ff5b7c": "Email",
  "4c641ebb": "Password",
  "-1dfda037": "Not Now",
  "-4ecbc6b7": "Choose your path",
  "67774d3b": "Sprinting for the first time",
  "36e13d1c": "Already run sprints",
  "10b9f442": "What if you knew exactly why your customers buy?",
  "1685b50c": "Discovery Sprints provides done-for-you customer interviews so you can get closer to your customers and make more confident strategic decisions.",
  "7f2746be": "Contact US",
  "-5391d581": "Do you know ",
  "1cbc8": "why",
  "74f665d3": " your best customers buy?",
  "18c9a693": "Answering this question with the voice of your customers is rocket fuel for sustainable growth and we're here to help 🚀",
  "-5f16671": "The harsh reality: Growing a software business is harder than ever.",
  "349f68e2": "The cost of acquisition continues to rise",
  "6386842a": "Today’s buyers are inundated with choices and standing out from the noise is harder than ever.",
  "1360b6f1": "Even if you are able to acquire customers, you need to make sure they are successfully activated and retained to build a sustainable flywheel.",
  "1f1d7ce6": "Creating a flywheel for sustainable growth today requires a deeper understanding of customers needs, behaviors and motivations than ever before.",
  "-11310281": "Companies that choose to adopt a ",
  "480ebbee": "product-led growth approach",
  "-237e2c74": " have over 2x valuation, 1.5x higher revenue, and 9% higher revenue growth compared to companies where internal processes for leveraging customer insights are lagging. Some food for thought:",
  "3782fef4": "7 out of 10 companies speak to less than 10 customers a month ",
  "-6030667e": "Only 12% of customers believe in “customer first” messaging",
  "76944a35": "81% of brands had stagnant scores for customer experience in 2019. ",
  "-6cd114af": "In other words, the answer to sparking success often lies in channeling customer voices and values and placing them at the heart of your product and company.",
  "5b0f5cf2": "What stops most companies from doing regular customer research? ",
  "-7dee1536": "One word: ",
  "27c6ed": "Time",
  "-158e0359": "Your time is already consumed by the day-to-day business of acquiring customers and managing your team. You don't have the additional hours or experience to dedicate effort to things like ",
  "-5f3496c2": "conducting in depth customer interviews",
  "-28c0d8ad": "analyzing unstructured responses",
  "4d05ec9d": ", and ",
  "-5ed727c": "extracting the actionable voice of customer insights",
  "-4bbb0dae": " with your already overflowing to-do list.",
  "-580c386d": "Imagine having a system in place to continuously learn from and get closer to customers.",
  "155d8bf0": "You'd have focus. You'd know exactly where to focus your team and resources, and prioritize projects your customers really care about.",
  "-73b87eec": "You'd have confidence. Instead of making strategic decisions based on what you \"think\" you know, you'd be armed with the voice of your actual customers.",
  "366d6da4": "You'd have clarity. Instead of the endless maze of directions to explore, you'd know the path that matters most to your customers.",
  "-108cc2c4": "You need a proven way to learn from your customers — we call this a “discovery sprint.”",
  "321b3de8": "A Discovery Sprint combines in-depth customer interviews with qualitative data analysis to identify high-leverage new growth opportunities based on your best fit customer's experience.",
  "-397028c5": "How A Discovery Sprint Works",
  "-3e251eeb": "1. Research Strategy",
  "-61cc7dfe": "We'll start by understanding your current goals and challenges and identifying the right customer segments to learn from. We'll design surveys to collect a baseline of insights and qualify participants for interviews. You'll get access to all our templates and playbooks for kicking off a discovery project.",
  "-81abf50": "2. Customer Interviews",
  "52203f29": "We'll schedule and conduct 45-60 minute Jobs-To-Be-Done interviews to understand your customers buying timeline. We'll dig deep into your customer's experience to understand their:",
  "4c7aa590": "First Thought - When did people first consider needing a solution?",
  "6bb7c465": "Struggling Moments - The current or previous events and situations that caused pain and frustration.",
  "-43601608": "Driving Forces - Emotions they want to feel or want to avoid feeling by seeking to change their current status quo.",
  "5b3b1097": "Alternative Solutions -The current behaviors and solutions that they are in the consideration set.",
  "-1512bdf2": "Job to Be Done - How they believe their life will be better by solving their problem with a new solution?.",
  "3e4477a7": "Listen in on a Jobs To Be Done interview",
  "-27932d28": "3. Qualitative Data Analysis",
  "-6d10938e": "We'll dig through the hours of interview transcripts and survey responses to extract the golden insights that lead to growth. ",
  "-3fe8da91": "Instead of pages of dense transcripts we'll map the buying journey uncovered in each interview across the Jobs To Be Done timeline and identify common themes and personas.",
  "70c98339": "Our reports help you see immediate customer driven opportunities, we're focused on getting you to share and implement your new learnings — not just read about them. ",
  "-66b2fcf0": "You’ll get ready to share insight presentations for your team, interview highlights, a private podcast feed and the full interview transcripts.",
  "50d2bba1": "Connor Cirillo",
  "-22d2814f": "Head of Conversational Marketing, ",
  "-520be889": "HubSpot",
  "-85fb39b": "I wish I could do research and I know it would help but the time it would take me to get only 80% as good as an expert is not worth the bandwidth taken away from things I’m actually an expert in.\"",
  "2a2557a4": "Head of Growth, ",
  "-64342b7f": "ColdBru",
  "-428e2b9d": "Here's how you'll be able to use customer insights to fuel sustainable growth",
  "4d522493": "1. Nail your positioning",
  "60bc10ca": "We'll identify the real reasons why customers choose to buy your product. You'll have a clear picture of your true competitors, your differentiating features and the decision criteria buyers use to evaluate you against the competition.",
  "-576e78d8": "2. Increase the ROI of your marketing campaigns",
  "-39dc66a": "The most effective marketers are able to reach their customers as close to when they first think about needing a solution to their problem as possible. Identifying the events that lead up to a buying trigger can be jet fuel for your marketing campaigns, enabling you to ",
  "-d5cfd52": "spend up to 80% less",
  "-3f2fb602": " on direct marketing costs to acquire customers.",
  "1f293e5c": "3. Convert more customers with copy that resonates",
  "-58f2cdd6": "With access to the real voice of your customers you'll be able to confidently invest in your next ad campaign, landing page design, or onboarding optimization confident that your message resonates with your target customers.",
  "1a5a1478": "Empower your team with all the information they need to target the right people at the right time with copy that converts.",
  "67b023d2": "4. Prioritize features that unlock growth",
  "-4f4ece3a": "Understanding why your best customers \"really\" buy your product and how the \"Aha\" moments they experienced will provide the insight you need to prioritize the features and projects that align with what they really need instead of building a roadmap based on internal assumptions.",
  "376efd14": "Need to make a business case for customer discovery?",
  "4a63056a": "We wrote this guide to help founders, marketers, and product managers understand how customer insights can help them increase conversions, reduce CAC, and generate more revenue.",
  "-3c1e30c7": "This guide is based on my own experience helping companies grow through customer discovery and best practices from the worlds top companies.",
  "1f4c9981": "Get the free guide",
  "85df112": "LEARN FOR YOURSELF",
  "-6abb5c00": "Learn More + Pre-Order",
  "55d919b0": "Done-FOR-YOU",
  "5eaa8d8c": "6,500+",
  "-1af8fba8": "Research Strategy",
  "33e0874": "Customer interviews",
  "7d30283f": "Transcription + Analysis",
  "-492b75a6": "Tactical Insight Reports",
  "7f2746de": "Contact Us",
  "3ff01d13": "Access Free Content Right Now",
  "500ccd02": "Enjoy our free content and get closer to your customers.",
  "42f2ad46": "Discovery Playbooks",
  "-409dcb5d": "Tactical field guides to help you get closer to customers.",
  "5f6a2d2f": "Short Loops Podcast",
  "d5a4d41": "Interviews with product and marketing leaders exploring what they do everyday to get closer to their customers.",
  "496b790a": "Want to chat with us first?",
  "-257b6f5b": "Schedule a call. Let's think through your cutomer discovery strategy.",
  "-71ad4d44": "© 2021 Balsm Labs LLC. All rights reserved.",
  "-43ab0bc5": "Customer Discovery Guide [2021]",
  "44057f27": "Understand the impact effective customer discovery can have on revenue and make a compelling case for operationalizing customer insights at your company.",
  "3b2a55e9": "Thank you! We'll send a copy of this guide straight to your inbox!",
  "3f4b8e7a": "No spam ever, guaranteed ",
  "3469f3c": "😁 ",
  "7983244a": "Unsubscribe anytime",
  "3610230d": "Text Link",
  "938c67e": "\"Every company in the world will tell you they are customer-driven...But after spending 20 years in my career building and leading SaaS companies, I’ve learned that none of that means anything unless you actually make the structural decisions to ensure it.”",
  "-74940006": "—David Cancel",
  "-645bab44": "Welcome to Getting Started with Customer Discovery. In this guide, you’ll learn about the gap between valuing customers and prioritizing them within a company. More importantly, you’ll learn the approachable ways you can close this gap by leveraging the interactions your company is already having. In closing, we highlight real examples of companies who have applied customer insights to make notable marketing, sales, and product gains. Here is an overview of what you’ll find in this guide: ",
  "-48882954": "7 out of 10 companies speak to less than 10 customers a month",
  "7471c586": "While companies know the customer matters and many strive toward a Product-Led Growth approach, internal processes are lagging. And it shows. Only 12% of customers believe in “customer first” messaging, and 81% of brands had stagnant scores for customer experience in 2019.  ",
  "372c96e7": "True customer focus means big gains for modern companies",
  "-28676b38": "Forrester identified moving up just one point on their Customer Experience Index can translate into an extra $244 million in incremental revenue for big box retailers. And Product-Led Growth SaaS companies, which put customer value at the heart of product and company, have over 2x valuation, 1.5x higher revenue, and 9% higher revenue growth.",
  "-63b625ac": "Customer discovery unlocks why customers behave the way they do",
  "1e02314f": "Quantitative data helps teams track market and product trends. But without qualitative data, teams are left guessing as to why customers behave in certain ways. Qualitative customer understanding reduces time-to-learning, reduces opportunity costs, and unlocks sustainable company growth. ",
  "5e2a0801": "You can learn more about your customers in minutes, not months ",
  "7ff": "A ",
  "22264eca": "Discovery Sprint",
  "-620ce9e0": " is designed to help your team glean actionable customer insights: from identifying the right segments to survey, to asking powerful questions, to analyzing data for trend analysis and patterns. ",
  "31f4d7ca": "Customer insights are the secret to SaaS success ",
  "-1000bb3d": "Product-Led Growth forerunners, such as Trello, Hubspot, and Appcues, showcase how insights can translate into major results such as 150% more users signing up and 37% more demo requests. ",
  "-55e4e2f": "Table of contents",
  "6b8b567f": "Part 1: Most companies don’t know their customer",
  "164e9d7": "The customer matters, but processes don’t show it",
  "-218a7932": "The further you are from the customer, the worse your product performs",
  "-59686978": "Customer understanding isn’t a nice-to-have",
  "-504a365": "Part 2: Customer discovery, or how to know your customer",
  "-10e8ce5f": "What qualitative discovery is and isn’t",
  "-55bbd057": "What are the objectives of customer discovery? ",
  "-4d1b36fe": "Part 3: How to implement a customer discovery process",
  "-54631044": "Right people, right time, right information",
  "-791a24bf": "Analyze what you collect",
  "137e4488": "Leverage insights for growth ",
  "-6fca4856": "Part 4: Applying and benefitting from customer insights",
  "7ddaaca5": "Marketing: Improve positioning, copy, and content strategy",
  "-3546eed4": "Product: Remove roadblocks and prioritize value",
  "1b7bec1a": "Sales: Optimize onboarding and improve time-to-value",
  "-2daf3f02": "Chapter 1",
  "-4c440a13": "Getting started with customer discovery",
  "-8eaf78c": "In the Product-Led Growth era, customer understanding is more important than ever. Yet most companies aren’t prioritizing customers, and the symptoms are troubling.",
  "2b3851a9": "The customer matters, but processes don’t show it ",
  "-69fa63da": "Companies know the customer matters. However, data shows most companies aren’t talking with customers or leveraging customer insights for scalable growth. ",
  "1b8855d8": "A Capgemini ",
  "68b0dc9": "study",
  "53dd4a11": " found that while 75 percent of companies believe themselves to be customer-centric, only 30 percent of customers believe this to be the case. When ProfitWell ",
  "53c24de5": "analyzed over 3,000 subscription companies",
  "-4de49b9": " and 1.2 million consumers, SaaS executives indicated that 7 out 10 organizations are speaking to less than 10 customers per month in a non-sales research capacity.",
  "-32115ad": "Other research indicates nearly half of companies aren’t even asking customers for feedback, let alone researching them. A HubSpot analysis found that 42% of companies don’t ask customers for feedback, and only 19% have a formal customer advocacy program. Even in the few companies where customer insights are a priority, ",
  "-4e771031": "User Interview research",
  "-5dfc120a": " indicates less than 40% of stakeholders know how to access research findings. Many major companies aren’t collecting qualitative customer data or don’t know how to act on that data when they do collect it. ",
  "-12fc14fe": "Worse, while companies may fool themselves into thinking they’re customer-centric, they’re not fooling customers. Only 12% of people ",
  "49186ad5": "believe company messaging",
  "-25ff5d64": " that claims to put the “customer first.” ",
  "7a397276": "“Saying your company is customer-centric is easy. Actually being customer-centric requires that you lead by example and walk the walk every day in every situation.” ",
  "-4e3ac785": "– Todd Olson, CEO/Founder at Pendo",
  "-44c58e7": "Companies say the customer matters, but most internal processes, practices, and budgets reflect otherwise. And this gap manifests itself in a number of expensive and troubling ways.  ",
  "18125ec4": "7 out of 10 organizations speak to less than 10 customers per month; only 19% of companies have a formal customer advocacy programer; only 12% of customer believe “customer first” company messaging",
  "227b5e55": "When a company fails to research customers, processize insight collection, and implement understanding, certain symptoms routinely appear. Most often, this looks like poor product engagement, flailing customer experiences, and expensive support inefficiencies. ",
  "-5c724e38": "Wasted features and poor product engagement ",
  "69bdf236": "When ProfitWell asked product leaders to assess the last 5,000 features they’ve built, leaders were confident they delivered high value features customers are willing to pay for. Yet when ProfitWell then asked ",
  "600e7c55": "customers",
  "-5c43cf48": " to assess features,",
  "-399661e7": " the data",
  "-2b282646": " told a different story. Customers ranked the majority of features as both low value and low willingness to pay, or high value but low willingness to pay.   ",
  "28adf2": "Via ",
  "-7332eebe": "https://www.profitwell.com/blog/customer-research-benchmarks",
  "-49cf64cb": "This is in line with earlier research from The Standish Group that ",
  "-2a704335": "indicated",
  "-77fe67f7": " 45% of features software projects ship are never even used. The opportunity costs from producing these features, not to mention the ones that teams abandon and never launch, are enormous. ",
  "-1073502f": "“It’s impossible to be customer-obsessed without addressing the digital expectations of those customers. But too often, those efforts get swallowed by technical minutia and fall prey to a pursuit of digital for the sake of digital. One common example is the proliferation of new mobile apps created to attract customers but that go unused. Despite the more than 1.6 million apps available to Android users and 1.5 million apps available in Apple’s App Store, customers still spend 84% of their time in just five of their favorite apps. The result: lots of shiny new (digital) objects that your customers don’t like or even care about.” ",
  "-284148ae": "– Forrester, The Operating model for Customer Obsession ",
  "-2ed836eb": "Rising acquisition costs and poor customer experiences",
  "-3b53d92f": "Software is easier and cheaper to produce than ever. Because of this lower production bar and increased competition, customer acquisition costs (CAC) are rising for both B2B and B2C companies. Research from ProfitWell indicates that CAC is up ",
  "206aa5c0": "nearly 60%",
  "-1baf492a": " across all sectors. For B2B markets that have been established for a decade and a half, the competition is even more fierce. In those sectors, CAC has increased by 70-75%. ",
  "-573073db": "Given how expensive it is to acquire customers, companies would do well to focus on customer experience and retention. But while executives know this is good practice, data shows there is disconnect here as well. According to Forrester, an overwhelming 87% of marketing decision makers say improving customer experience is their top priority, but Forrester’s research also indicates that ",
  "39fd76a0": " aren’t getting better. In 2019, 81% of brands had",
  "189f82a1": " stagnant scores",
  "aa6e4d0": " for customer experiences. ",
  "544ffe32": "Expensive support inefficiencies  ",
  "-511d2e55": "When Hubspot analyzed a year’s worth of support cases, they discovered an expensive problem—41% of support requests were solved with a documented solution. When they tallied up the time support employees had spent addressing these cases, Hubspot realized they ",
  "-51c24b98": "spent $7M",
  "1bfb308f": " helping customers find existing answers. ",
  "-f739065": "Because Hubspot prioritizes customer success, they were able to correct this expensive flaw and serve customers even better. But for the 56% of companies who don’t offer a knowledge base at all, the annual costs are even higher. Especially in light of research from Forrester that indicates ",
  "-318e7389": "72% of US online customers",
  "d813b33": " prefer to use a company’s website to get answers to their questions. ",
  "428a6445": "72% of customers prefer to use a company’s website to get answers; 56% of companies don’t offer any knowledge base ",
  "63237cc0": "Customer understanding isn’t a nice-to-have; it’s essential ",
  "-7366eeb6": "Back in 2011, Forrester ",
  "-505910c8": "predicted",
  "4fc46dad": " our current time period would be the age of the customer. ",
  "2f3f78da": "“The only source of competitive advantage is the one that can survive technology-fueled disruption — an obsession with understanding, delighting, connecting with, and serving customers. In this age, companies that thrive are those that tilt their budgets toward customer knowledge and relationships.”  ",
  "-ba7236a": "– Forrester, Competitive Strategy in the Age of the Customer",
  "-1656706f": "Their prediction proved true. In 2019, Forrester found that moving up just one point on Forrester’s Customer Experience Index ",
  "-66a2c72a": "translated",
  "-1c667252": " into an extra $244 million in incremental revenue for big box retailers. A decrease in experience translated to an equally dramatic loss. ",
  "-7e6533f0": "Today’s top ",
  "16185d7a": "Product-Led Growth",
  "1f008a93": " (PLG) companies indicate that customer-centricity has a proportionately large impact in SaaS as well. Compared to other players in the SaaS market, PLG companies have over 2x valuation, over 1.5x higher revenue, and over 9% higher revenue growth.",
  "202852f0": "https://openviewpartners.com/product-led-growth-index/",
  "3163597c": "In today’s climate, SaaS companies can’t win their markets without strong products. But teams can’t build strong products without rich customer understanding. As Hiten Shah ",
  "14c752d7": "observes",
  "3031f136": ", “You’ll create the best product if you know more about customers than your competitors and you act on that knowledge.”",
  "3755e992": "So how do teams get closer to the customer, not just in theory, but in revenue-boosting practice? ",
  "-2daf3f01": "Chapter 2",
  "-4baba6b0": "Customer discovery, or how to know your customer",
  "-577e0b2c": "Quantitative data identifies what is happening in our products and markets. Qualitative data helps you learn \"why\" your customers buy and identifies new opportunities. Your team needs both. ",
  "5328d4e1": "What qualitative customer discovery is and isn’t",
  "-4826df26": "Customer discovery is more than interaction",
  "17d50e7c": "By necessity, SaaS businesses interact with their customers. They send marketing emails, make sales pitches, and provide timely support. Leaders often look at this activity and say, “We’re talking with customers all the time!”  ",
  "-229049ba": "However, having conversations with customers doesn’t make a company customer-driven. And it doesn’t mean the company is conducting customer discovery.",
  "3b647b50": "Sales, support, and marketing conversations all happen in a specific context where, 99% of the time, the point of these conversations isn’t to learn about the customer. These activities aren’t wrong, but they aren’t discovery.",
  "-23568388": "What’s more, employees having these conversations usually aren’t ",
  "6e798eca": "incentivized",
  "-5631add9": " to learn about the customer. They’re incentivized to perform or deliver; their metrics are activities such as tickets closed, sprints completed, hours spent, and amount of data collected—metrics misaligned with the customer.",
  "-79d36c3d": "Customer discovery is more than quantitative data collection",
  "-550244cc": "Other businesses assume they discover who their customers are through quantitative data. Data provides valuable information about what customers are doing and how, but product and market metrics only paint ",
  "3463f3": "part",
  "710b252c": " of the picture teams need. ",
  "24b30afd": "“...the quantitative data will tell us what’s happening or not happening; but it can’t tell us why something’s happening or not happening.”  ",
  "6bb0a633": "– Marty Cagan, Partner at Silicon Valley Product Group",
  "-6e3d0a2e": "To truly align products with customers and innovate solutions that meet real needs, internal teams need to understand the",
  "1fa9d78": " why ",
  "-60c61f0b": "behind the ",
  "37aac4": "what",
  "343195fd": "Qualitative customer discovery is all about why",
  "-211d5422": "Qualitative customer discovery includes all the activities around aligning companies with their customers’ real lives and addressable problems. ",
  "-fb159ae": "“User research is not only about understanding your users, but understanding how they think, act, and feel when it comes to engaging with the product or service you are offering. Companies have plenty of demographic data about their audience (age, gender, location), but user research can actually give you qualitative, behavioral insights about what your users do or how they use your product. In all these years working in UX, there has never been a single time when I did user research and learned nothing new. You simply cannot ‘know your users too much.” ",
  "63e24322": "– Fabricio Teixeira, Founder of UX Collective",
  "-371612fc": "And while some customer discovery tactics, such as group studies, can be expensive, many are not. Surveys (in-app or otherwise) and conversations with customers can take minutes and happen every day. ",
  "68dfe62e": "For example, Discovery Sprints are designed to help you collect and leverage qualitative customer feedback without hiring an expensive in-house UX research team. Our service is powered by smart humans running constantly improving playbooks to help you collect, identity, and leverage qualitative insights on a daily basis. ",
  "-5d9ab429": "What are the objectives of customer discovery?",
  "5ef58218": "Improve time to learning",
  "-527ef086": "There are two stages of producing a product or feature. The first stage is discovery, where a company or team determines what to pursue. The second stage is delivery, where a company or team delivers what they decided to pursue. In discovery, time to learning is priority; in delivery, time to market is the primary concern. ",
  "-dc9b9eb": "The 2020 ",
  "3dc8d0fe": "State of User Research report",
  "-31ab69aa": "Customer understanding illuminates the discovery process for teams. When teams know what the customer wants and why, they can easily identify the next product improvement. This understanding speeds up time to learning in discovery, and it helps teams get to market quickly in delivery as well. Qualitative insights speed up the entire process of producing a product or feature.",
  "73fb1038": "Cultivate continuous understanding ",
  "3a249341": "Customers’ lives aren’t stagnant. To stay relevant and maintain growth, companies must continuously assess what is and isn’t important to their customer base. In light of the global pandemic of 2020, positioning expert April Dunford explains:",
  "4a976fdb": "“The key thing is that you need to be tuned into what's valuable for your customers right now. You need to be open to the idea that their priorities may have shifted and the way you position your offering might have to shift to stay aligned with them.”",
  "-718f7bbb": "Customer discovery keeps companies aligned with customer needs, whether the market shifts slightly to accommodate a new player or the entire economy shifts dramatically in light of world events. ",
  "15752a4a": "Reduce expensive opportunity costs",
  "42238e56": "Companies often cite reasons such as “it’s too expensive” or “it’s too time consuming” for why they don’t invest more in customer understanding. However, building the wrong features (not to mention product) is significantly more expensive and time consuming. ",
  "-679a717c": "Imagine 1 frontend developer, 1 backend developer, 1 designer, and 1 project manager spend two weeks producing a small feature. If you assumed the average hourly rate for each of these, and assume the developers each spend 30 hours on the product, the designer 50, and the project manager 30, the cost for this small feature would be around [cost]. ",
  "-48abd56c": "This is the price of building one small feature that delivers little to no value for the customers and business. The true opportunity cost is much higher, because opportunity cost accounts for ",
  "1aad3": "not",
  "-e09e87b": " building the right feature as well. ",
  "1424aef3": "Collecting and organizing customer insights lowers or eliminates these opportunity costs by reducing guesswork for the product teams. ",
  "-625fde36": "“...it’s critical to avoid guessing as much as possible. Talk to your customers, understand the value you’re delivering. Do all the homework to make sure that you’re getting all the details right.” ",
  "4ef035eb": "– Scott Williamson, Vice President of Product Management at GitLab",
  "-1490e07a": "Unlock sustainable growth",
  "1453028b": "Companies are increasingly data-rich. They have reports on the market, metrics on product usage, social media counts, and countless tracking around events. In fact, most companies have more data than they know what to do with, but fewer insights than they need. According to Forrester, only ",
  "63e4e4f4": "29% of companies",
  "2064352d": " say they’re good at mapping data and analytics to measurable business outcomes. ",
  "-77d9e0f4": "However, the companies that can both identify and act on customer insights are the ones who get ahead.",
  "38ee523d": "“Customer-obsessed firms embed digital capabilities in every nook and cranny of the organization. Dominos, for example, has used digital technology to push customer interactions to new heights with features like text-based ordering and to iterate quickly based on consumer feedback. This type of leadership has spurred 9.8% projected growth over the past two years.” ",
  "57ecc732": "– Forrester, The Operating Model for Customer Obsession ",
  "-2daf3f00": "Chapter 3",
  "7bc276da": "How to implement ongoing qualitative customer discovery",
  "377b234a": "Capture the right information, analyze what you collect for insights, leverage those insights for growth. Rinse and repeat.",
  "5deaf3b8": "First things first: lay a sure foundation",
  "-1f63129e": "Introducing a customer discovery process is worthwhile, but it can be tricky. To orchestrate change well, you'll need stakeholder and team buy-in. You'll also need to lay groundwork around why the process matters, how it will work, and what results your company can expect. ",
  "-47cb9779": "Here are several steps you can take to lay a foundation in your organization: ",
  "e6f454b": "Establish vision:",
  "300b5bc6": " If your team or stakeholders aren't sold on understanding the customer, you'll want to start here. Use data and evidence from this guide to explain the benefits of understanding your customer. Paint a vivid picture of customer insights ROI.  ",
  "-5a448308": "Determine process:",
  "3ae6c213": " Identify what type of data teams will collect, how they will gather it, and where it will live. Define the shelf-life of your data as well. Will you keep all of it for three years? Or might some insights expire? ",
  "-5eb62ce3": "Create organization: ",
  "-33e1161d": "Provide clarity around how you'll organize and label insights. What kind of taxonomy or classification system will you use? How will you store insights in a clear and useful way?",
  "-286ff3fe": "Invite ownership:",
  "-d3f5e61": " Decide whether one person or the entire team will be responsible for managing insights. Explain who will have access to the insights, and who is responsible for their upkeep. ",
  "5cc7c19f": "Plan distribution:",
  "-566183fa": " An insight locked in a vault is hardly useful. Determine how teams will access and leverage insights for their own uses. How will teams collaborate around the collected information? ",
  "7aa311e1": "Select a tool: ",
  "7b1bd2f2": "What tool(s) will you use to interact with the customer and aggregate insights? Consider security, data structure, integrations, and features like search. ",
  "-6b66bec4": "Define success:",
  "36720bf4": " If your process is working, what will success look like? And how will you measure progress along the way? Identify what a successful customer discovery process will produce for your organization. ",
  "52562f60": "Once you lay a foundation, you’re ready to start collecting insights. ",
  "211a5b21": "Engage the right people",
  "235b0788": "The “right” customer will always depend on what question your team is asking. In many cases, the right customer will fall in one of three broad categories: recent sign-ups, recent cancellations, and product advocates. ",
  "-c166518": "Recent sign-ups can help answer questions such as, “why are customers choosing our product?” and “what’s going on in their lives that caused them to sign up?” The responses and patterns in the responses here can heavily influence landing page strategy, acquisition channels, and onboarding flows. ",
  "3f176e2b": "Recent cancellations can help answer questions such as, “why did you quit our product?” Insights here can help teams make strategic improvements such as improving positioning (perhaps customers cite unmet expectations) and reducing churn (by addressing major frustrations). ",
  "-3272bc51": "And product advocates, or those who excel with your product and advocate it to others, help teams answer “who is our ideal customer” and “what job are they trying to do?” Insights here help hone segmentation and positioning, as well as feature prioritization.   ",
  "6442357b": "The right segment varies by company and question, which is why we'll help your team identify the right time and place to interact with customers, such as immediately after a customers first project completion or 5 consecutive days of activity. ",
  "5818bae6": "Ask at the right time",
  "52562e7f": "Imagine your team is surveying recent sign-ups. The responses your team will receive if they prompt customers within 24 hours of signing up will be very different than the responses they will receive if they prompt customers within 3 weeks of signing up. With the first group, the customer’s motivations and expectations will be much fresher and much more relevant to targeting and converting other new customers. ",
  "-51c227aa": "Similar logic applies for any other segment your team targets. Not only do they want to select the right segment to engage, they want to engage them at the right time. The “right” time means the time most likely to deliver actionable feedback relative to the problem your team is trying to solve.",
  "7f3400ee": " can help you target the right customers at the right event-driven intervals for fresh insights. ",
  "2a75155": "Pose the right questions ",
  "-3556ae5e": "Once your team has identified the right people to ask and the right time to ask them, they’ll need to ask the right questions. And counterintuitively, the right question is never a leading question or one that asks the customer to speculate on future behavior (all people are notoriously bad at predicting this). ",
  "-2ec97b94": "“Always be talking to your customers. Uncover the pain, solve the problem and then build on ramps that allow customers to share more of their pain so you can repeat the cycle. Note that I don’t mean ask customers what features will satisfy them—that’s an endless and thankless dark path. Instead, focus on core needs and use the team’s ingenuity to find solutions consistent with your vision.” ",
  "5e2bb3b8": "– Oji Udezue, Vice President of Product, Calendly",
  "-6df13886": "A Discovery Sprint provides the ability to gather valuable customer feedback at key milestones using ",
  "1d8bf761": "Jobs-to-be-done interviews",
  "7968ca7c": " and targeted surveys.    ",
  "-18492226": "Analyze what you’ve collected",
  "aecc302": "Once your team collects qualitative data, they need a way to separate signals from noise. We use a mix of human intelligence and natural language processing (NLP) to run sentiment and trend analyses, helping your team quickly identify patterns. ",
  "d75366c": "Additional tools and sorting, such as word clouds that help identify key phrases, enable teams to parse the motivations and needs of customers. An emphasis on Jobs-to-be-done (JTBD) enables teams to highlight desired outcomes, identify powerful motivations, and categorize alternative solutions. Build and market products to the whole customer, in the context of their busy lives, with rich and visually represented insights. ",
  "d80f266": "“The advantage we have as modern marketers is access to a wealth of data generated via online interactions. Each interaction is an opportunity to collect additional data points not only about individual prospects, but also about what the customer journey looks like overall. The key to extracting value from all this information is knowing how to harness it to reveal insights that inform your sales and marketing efforts.” ",
  "-b635dc8": "– Laura Borghesi, Senior Director, Growth Marketing, MongoDB ",
  "15b1f20c": "Leverage customer insights for growth",
  "50748bb": "In the final stage of customer discovery, teams map customer insights to business goals or opportunities. They also begin building feedback loops into the product that deliver a continuous flow of insights for ongoing collection and analysis. This can lead to higher ROI on resources, higher feature engagement, lower CAC, greater retention, more positive future feedback, and ",
  "2b3ef7df": "high brand affinity",
  "56eeead8": ". (See examples below.)",
  "-2daf3eff": "Chapter 4",
  "-6e1c16a": "Applying and benefitting from qualitative insights",
  "-1dc71e3f": "Successful Product-Led Growth companies prove that collecting and ",
  "-6f65d611": "leveraging customer insights",
  "5d1bda26": " can boost every area of operations. ",
  "71e22b65": "Marketing: Improve positioning, copy, and content strategy  ",
  "6f604588": "Understanding the customer’s journey, from initial trigger to raving success, is the easiest way to create an effective marketing strategy. From improved positioning to more compelling landing page copy to content strategies that convert, there’s no substitute for qualitative customer understanding. ",
  "-16bd9988": "Align positioning with product value ",
  "373e1c4b": "Trello could have positioned itself as a to-do list, notes-app, or organization system. It certainly shares features with each of those categories. But this isn’t how customers use the product, nor does it match how the product provides value. ",
  "-5f51b857": "“In Trello, we have two different kinds of users: creators (people who add cards, move them around, write comments, attach files, etc.) and observers (managers, executives and so forth who view boards to follow progress, but aren’t creating as often).” ",
  "46fcf787": "– Justin Gallagher, Head of Product Management at Trello ",
  "52f0845a": "Instead, the team at Trello positions their product as a collaborative tool. This positioning immediately sets the expectation that Trello is something you use with colleagues. Not only does this promote word-of-mouth virality as customers invite collaborators, it aligns with how customers actually use the product—a key reason Trello now has over 35,000,000 registered users today.",
  "-7445cab6": "Craft landing page copy that converts ",
  "1d8b8a9": "When Hubspot updated their website copy as part of a redesign, they didn’t simply guess at which words to put on the screen. Instead, they researched their customers to see what language would resonate the most with ",
  "364e1c": "them",
  "550280f6": ". With the help of several copywriters, Hubspot identified three important customer segments to talk with and prompted those segments to understand pain points, anxieties, desired outcomes, and priorities. ",
  "-4658d575": "They then organized these insights and analyzed them to unearth recurring themes, frequently used words, and well-said soundbites. From there, Hubspot applied those patterns and insights to the homepage, product pages, and other parts of the website. ",
  "-1583e40d": "Within a few weeks of going live, a new flow doubled the site’s overall conversion rate. Hubspot also saw a 35% increase in the total volume of demo requests and a 27% increase in product signup’s post launch. ",
  "-191c5211": "Solidify an effective content marketing strategy ",
  "403a4603": "ProfitWell research found that content CAC is about ",
  "16dcbbd8": "15% less",
  "1167a84b": " than paid CAC and that companies with a blog receive 67% more leads than companies without a blog. While it’s clear that content works, it’s less clear exactly how you make it work—especially if your market is anything but new. ",
  "-4141bdbf": "Casper, the mattress startup with a $1B valuation, used customer insights to figure out to make content work for them. They identified that customers are most likely to consider a new mattress between ",
  "562f4755": "1-3 AM",
  "-6211d87c": ". Through engaging with customers, they learned that a unique set of triggers (like getting a dog) prompted potential buyers to think seriously about better sleep. Based on this customer journey, Casper produced content for their 2am restless sleepers and targeted keywords such as “how to go to sleep earlier.” ",
  "2a3b2884": "Casper then retargeted readers through ads to move them further along the buying decision. Overall, knowing what their customer’s journey looked like enabled Casper to create a smart and effective content marketing strategy that set them above competitors in an already crowded marketplace. ",
  "-7396eb0c": "Product: Remove roadblocks and prioritize value ",
  "-3793c2e8": "When a product or product feature falls flat, it can be difficult to know what to improve. Customer insights help solve the mystery and illuminate pathways to creating more profitable user experiences. ",
  "47e58e2d": "Remove roadblocks and increase activation  ",
  "-2d448c58": "Appcues was sitting at a 13% completion rate for moving new users from sign up to the “",
  "-7af6203a": "aha moment",
  "469e128f": "”—the moment when everything clicks and customers realize the value in a product. Thirteen percent was an okay rate, but Appcues knew they could improve. ",
  "-1c38ac80": "When they closely monitored onboarding sessions, they made a crucial discovery: most customers weren’t making it to a critical value page. With the help of a simple redirect, Appcues improved the value journey in onboarding, and ",
  "-7a882015": "completion rates jumped to 32%.",
  "452776a": " Director of Marketing, Ty Magnin, ",
  "-72ff25a4": "explains",
  "3737d79a": ", “That means 150% more new users signing up for Appcues are finding their Aha Moment. Which means the world for our activation rate.”",
  "-22f9ff41": "Identify features correlated to success and retention",
  "-4bb69fa": "As a Product-Led Growth company, Typeform prioritizes customer understanding. And thanks to quantitative and qualitative ",
  "-1ec6772c": "data collection",
  "3a17b9c1": ", they’ve been able to isolate a powerful leading indicator that correlates with higher retention. That indicator is the number of Typeforms a customer creates. This knowledge gives Typeform clarity around what to promote in education content and what to document in the Help Center. ",
  "-64d7c036": "Another way Typeform leverages customer understanding is through their quarterly “customer voice” report. The customer experience (CX) team generates this report by pulling data from support tickets, churn surveys, sales calls, and other touch points. In one instance, the CX team identified that the majority of Typeform’s churn is due to the fact that customers don’t know what to do next, once they’ve created their initial form. This insight drove creation of the “What’s your next Typeform” campaign, that promotes inspirational content to a specific customer segment at a critical point in their journey. ",
  "-526c0c61": "“Through our churn survey, we found that a lot of our churn isn’t actually due to customers being unhappy, but rather from people successfully completing a project and not knowing what to do next. As a result, beyond the typical ‘feature-based’ content one would expect in a help center, our education team also creates content that is ‘job-to-be-done-based’ in order to inspire customers to do more with Typeform than they had initially intended.” ",
  "-1c4f5b77": "– David Apple, VP of Customer Success and Sales at Typeform (former)",
  "-265222d5": "Sales: Improve onboarding and time-to-value",
  "37623ba2": "For many companies, the product experience is now integral to converting customers. This means that it’s more important than ever to attract the right customers and provide a frictionless way for them to experience the value of your product. ",
  "-c25076f": "Reducing onboarding friction for higher MRR",
  "-2ce67e2f": "OpenView ",
  "1fa8d28d": "surveyed 500+ SaaS leaders",
  "50a93f78": " and found that, for companies who offer a free version of their product, only 13% believe the product can explain itself to new users. Among companies without a free version, the results were even worse—only 5% felt the product can thoroughly explain itself to new users. ",
  "-32333df3": "In most companies, there are enormous opportunities to improve onboarding and a wide variety of associated metrics, such as ARR and MRR.",
  "7023e0b0": "For example, it’s standard practice to require an email address activation before users can log into a product. And that’s exactly what Christopher Gimmer, CEO of Snappa, was doing before ",
  "33350bf1": "he realized",
  "-7bb3b927": " 27% of signups never activated their email address. Meaning 27% of new users never even set foot in the product. When Gimmer removed the email activation step, he quickly saw a 20% boost in MRR. ",
  "-48f86833": "“Experience has shown us that even a moderate level of effort can deliver huge returns, and a strategic effort can shift a business’ growth substantially. More than just a way to get your customers started with your product, onboarding is a powerful tool that helps you deliver value, provide support and improve ease of use, all of which result in happier customers, improved activation, increased retention and higher profitability.” ",
  "-74d3bb32": "– Jonathan Kim, Founder at Appcues",
  "72b1a99c": "Want us to take customer research off your plate?",
  "2e38b7c5": "If you’re overwhelmed by where to start and how to do it all, I can handle the research for you.",
  "-2d7cfbc0": "I’ve been doing customer discovery and Jobs to Be Done interviews for more than five years and my battle-tested system has you covered. From identifying who to speak with and why, to organizing and sharing insights with your team, I’ll help you identify the information you need so you can drive the growth you want.",
  "43704a55": "Book a Strategy Call",
  "75cf2196": "Ready to get closer to your customers than ever before?",
  "-2800b1e": "If you’re tired of throwing spaghetti at the wall, want to feel confident in your strategic decisions, and are ready to invest at least $6,500 in getting closer to your customers, we can help you unlock the insights you need to grow.",
  "110fd73d": "We’ll brainstorm some ideas to identify your best customers, improve messaging and prioritize your work:",
  "2b77184c": "Take a look at your current customer discovery efforts to see what is/isn't working.",
  "-6623f508": "Identify the best way to learn about your customers based on your specific goals and target customers.",
  "232b356f": "If we feel we're a good fit we’ll discuss how we’ll get you deep customer insights and answers to your specific challenges with our Discovery Sprint methodology.",
  "-19abbcd1": "Schedule a Free Customer Discovery Strategy Session",
  "776023aa": "Fill out the form and book time to connect on the next page.",
  "24eeab": "Name",
  "-2b7010d0": "Email Address",
  "-54a28412": "How did you hear about us?",
  "5b7f3c8e": "Company Name",
  "284dc825": "Thank you! We'll send you an email shortly!",
  "-175da784": "Long-term advisory",
  "c89c40f": "About Long-term advisory",
  "-5507904e": "For founders who want to continue working with me on a regular basis, I form formal advisor relationships. I can help with anything from fundraising preparation, supporting you through a fundraise, and other strategy + operations-related challenges as an early stage founder/operator.",
  "-425a75dc": "Short Loops Newsletter - by Stuart Balcombe",
  "-db6398c": "Here’s an example of what you’ll get >",
  "-6d5fea1e": "Heading",
  "2268ff": "Home",
  "-8fb26a5": "Button Text",
  "-149ceef3": "Offerings"
}